// напишите программу, которая на вход принимает число и
// выдает его квадрат (число умноженное на само себя)
// например:
// - 4 -> 16
// - 3 -> 9
// - 7 -> 49
// task001.drawio.png  подключает модуль DrawIO для рисования блок схем

int value = 11;
int result = value * value;

Console.Write("Квадрат числа равен ");
Console.Write(result);