// напишите программу, которая принимает на вход число (N) и выдает таблицу квадратов чисел от 1 до N/
// 5 -> 1,4,9,16,25
// 2 -> 1,4

void TableSquares(N) 
{
    
    //Console.WriteLine($"отрезок равен {Math.Sqrt(Math.Pow(x2 - x1, 2) + Math.Pow(y2 - y1, 2))}"); //:f2 добавив это значение выражение округлим до 2 знаков после запятой
}

Console.Write("Введите координату х1 точки А ");
double x1 = double.Parse(Console.ReadLine()!);
Console.Write("Введите координату y1 точки А ");
double y1 = double.Parse(Console.ReadLine()!);
Console.Write("Введите координату x2 точки В ");
double x2 = double.Parse(Console.ReadLine()!);
Console.Write("Введите координату y2 точки В ");
double y2 = double.Parse(Console.ReadLine()!);

LengthSegment(x1, y1, x2, y2);